Documents/бит_ЕдиныйЖилДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ЕдиныйЖилДокумент</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыводитьВесьСписок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьПаспортныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеДругогоЖилья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новостройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Округ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АдмОкруга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицоОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПригодностьДляЖилья</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеСтандартамБлагоустройства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправкаПоСмерти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСистемыГВС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодственныеОтношения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПроживания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Коммунальные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЖилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолвоПроживающих</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тяжелобольные</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЗначениеСвойствОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначениеСвойствОбъектовУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_СвойстваОбъектовУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ГрафыОтчетаПоГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ГрафыОтчетаПоГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаНайм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывозБытовыхОтходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отопление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Газ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГорячееВодоснобжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХолодноеВодоснабжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчисткаСтоков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХВСДляГВС</Name>
					<Comment>Холодная вода для подогрева и обеспечения горячего водоснабжения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_ЕдиныйЖилДокумент/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

Перем мСписокФизЛиц; // Список физлиц по выбранному лицевому счету. 

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаКлиенте
// Процедура открытия формы выбора справочника - всего списка или активной строки.
//
Процедура ПолучитьИзСправочникаПроживающие(Элемент = Неопределено)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	
	Если Элемент = Неопределено Тогда
		ОткрытьФорму("Справочник.бит_Проживающие.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ОткрытьФорму("Справочник.бит_Проживающие.ФормаВыбора", ПараметрыФормы, Элемент);	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

&НаКлиенте
// Процедура изменения данных поля Физ лицо.
Процедура ФизЛицоПриИзменении(Элемент)
	
	ЗаполнитьПоЛС(Неопределено);	
	
КонецПроцедуры

&НаКлиенте
// Процедура начала выбора поля Физ лицо.
Процедура ФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Элементы.ФизЛицо.СписокВыбора) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните ""Лицевой счет""!";
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода "ЛицевойСчет".
//
Процедура ЛицевойСчетПриИзменении(Элемент)
	Объект.ФизическиеЛица.Очистить();
	Объект.Коммунальные.Очистить();
	Если Объект.СправкаПоСмерти Тогда
		
		СписокПроживающихЛиц(Объект.ЛицевойСчет);
		
	Иначе
		
		Если Объект.ВыводитьВесьСписок Тогда
			
			СписокПроживающихЛиц(Объект.ЛицевойСчет,Истина);
			
		Иначе
			
			СписокПроживающихЛиц(Объект.ЛицевойСчет);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ПризнакКоммунальной = ПолучитьПризнакТипаКвартиры();
	
	Если ПризнакКоммунальной Тогда
		ДанныеКоммунальныхКомнат = ПолучитьДанныеКоммунальныхКвартир();
		Если ДанныеКоммунальныхКомнат.Количество() > 0 Тогда
			ЗагрузитьКоммунальныеКомнаты(ДанныеКоммунальныхКомнат);
		КонецЕсли;
	КонецЕсли;
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКоммунальныеКомнаты(ДанныеКоммунальныхКомнат)
	
	Объект.Коммунальные.Загрузить(ДанныеКоммунальныхКомнат);            
	
КонецПроцедуры

&НаСервере 
// Процедура осуществляет управление доступностью/видимостью элементов формы.
//
// Параметры:
//  Нет.
//
Процедура УправлениеЭлементамиФормы()
	
	Если Объект.ЛицевойСчет <> Справочники.бит_ЛицевыеСчета.ПустаяСсылка()  Тогда
		ПризнакКоммунальной = ПолучитьПризнакТипаКвартиры();		
		Если ПризнакКоммунальной Тогда
			Элементы.КоммунальныеДанные.Доступность 	= Истина;
			Элементы.КоммунальныеДанные.Видимость 		= Истина;
		Иначе	
			Элементы.КоммунальныеДанные.Доступность 	= Ложь;
			Элементы.КоммунальныеДанные.Видимость 		= Ложь;
		КонецЕсли; 
		
	иначе  
		Элементы.КоммунальныеДанные.Доступность 	= Ложь;
		Элементы.КоммунальныеДанные.Видимость 		= Ложь;
	КонецЕсли; 
	
	Если Объект.СправкаПоСмерти Тогда
		Элементы.ДатаСмерти.Доступность = Истина;
		Элементы.ДатаСмерти.Видимость 	= Истина
	Иначе
		Элементы.ДатаСмерти.Доступность = Ложь;
		Элементы.ДатаСмерти.Видимость 	= Ложь
	КонецЕсли; 
	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Установить видимость реквизитов и заголовков колонок.
	УправлениеЭлементамиФормы();
	
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		
		ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
		
		СписокЗначенийФизЛиц = СписокПроживающих(ДокументОбъект.ЛицевойСчет);
		мТаблицаФизЛиц.Загрузить(ФормированиеДанныхТабЧасти(СписокЗначенийФизЛиц, ДокументОбъект.Дата));
		
	КонецЕсли; 
	
	ЭтоНовый = ?(Параметры.Ключ.Пустая(), Истина, Ложь);

	Если ЭтоНовый И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда   
		
		Объект.Организация 		= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
		
		Объект.Ответственный 	= бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		
		Объект.СоответствиеСтандартамБлагоустройства = Истина;
		Объект.ПригодностьДляЖилья = Истина;
	КонецЕсли;
	
	// БИТ ЖКХ 14.01.2020
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    //	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПечатьПодменю);
	
	Элементы.ПечатьПодменю.Вид = ВидГруппыФормы.Подменю;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// При заполненном значении лицевого счета формируется список физлиц,
	// Прописанных по этому ЛС.
	Если НЕ Объект.ЛицевойСчет.Пустая() Тогда
		
		СписокПроживающихЛиц(Объект.ЛицевойСчет);
		
		ПризнакКоммунальной = ПолучитьПризнакТипаКвартиры();
		
		Если ПризнакКоммунальной Тогда
			ДанныеКоммунальныхКомнат = ПолучитьДанныеКоммунальныхКвартир();
			Если ДанныеКоммунальныхКомнат.Количество() > 0 Тогда
				ЗагрузитьКоммунальныеКомнаты(ДанныеКоммунальныхКомнат)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	мКэшРеквизитовФормы = Новый Структура;
	
КонецПроцедуры

// Процедура - обработчик события "ПослеЗаписи" формы.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура ЗаполнитьПоЛС(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Лицевой счет не указан!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнено Физ. лицо!";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ФизическиеЛица.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоЛСЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;      
	КонецЕсли; 
	
	ЗаполнитьПоЛСФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЛСЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса ;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;      
	
	ЗаполнитьПоЛСФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЛСФрагмент()
	
	Если Объект.СправкаПоСмерти Тогда
		
		СписокПроживающихЛиц(Объект.ЛицевойСчет);
		
	Иначе
		
		Если Объект.ВыводитьВесьСписок Тогда

			СписокПроживающихЛиц(Объект.ЛицевойСчет,Истина);
		Иначе

			СписокПроживающихЛиц(Объект.ЛицевойСчет);
		КонецЕсли; 
		
	КонецЕсли; 
	
	ЗаполнитьТабличнуюЧасть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
	
	Объект.ФизическиеЛица.Очистить();

	мСписокФизЛиц = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	СписокЗначенийФизЛиц = мСписокФизЛиц.Скопировать();
	Если  СписокЗначенийФизЛиц.Количество()>0 И ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		
		Если СписокЗначенийФизЛиц.Найти(Объект.ФизЛицо,"ФизическоеЛицо")<> Неопределено Тогда
			
			НомерИндекса = СписокЗначенийФизЛиц.Индекс(СписокЗначенийФизЛиц.Найти(Объект.ФизЛицо,"ФизическоеЛицо"));
			СписокЗначенийФизЛиц.Удалить(НомерИндекса);
			
		КонецЕсли;
		
	КонецЕсли;
	Если СписокЗначенийФизЛиц.Количество()>0 Тогда
		
		ЗагрузкаТабЧасти(СписокЗначенийФизЛиц, Объект.Дата);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзСправочника(Команда)
	ПолучитьИзСправочникаПроживающие();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_Проживающие") Тогда
			
			ДобавитьФизическоеЛицоНаСервере(ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьМакета(Команда)

	Результат = Сформировать();

	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(Результат, АдресТабличногоДокументаВоВременномХранилище);
	
	бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	,"бит_ЕдиныйЖилДокумент"
	,"ЕдиныйЖилищныйДокумент"
	,"Единый жилищный документ"
	
	,АдресТабличногоДокументаВоВременномХранилище
	
	,Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляФизическиеЛица

&НаКлиенте
Процедура ФизическиеЛицаФизическоеЛицоПриИзменении(Элемент)
	
	ВыбранноеФИзЛицо = Элементы.ФизическиеЛица.ТекущиеДанные.ФизическоеЛицо;

	Элементы.ФизическиеЛица.ТекущиеДанные.ДатаРождения = ПолучитьДатуРожденияНаСервере(ВыбранноеФИзЛицо);

	Отбор = Новый Структура;
	Отбор.Вставить("ФизическоеЛицо",ВыбранноеФИзЛицо);
	МассивПоиска = мТаблицаФизЛиц.НайтиСтроки(Отбор);
	
	Если МассивПоиска.Количество()>0 Тогда
		Элементы.ФизическиеЛица.ТекущиеДанные.РодственныеОтношения 	= МассивПоиска[0].РодственныеОтношения;
		Элементы.ФизическиеЛица.ТекущиеДанные.СтатусПроживания 		= МассивПоиска[0].СтатусПроживания;
		
	Иначе	
		Элементы.ФизическиеЛица.ТекущиеДанные.РодственныеОтношения 	= Неопределено; 
		Элементы.ФизическиеЛица.ТекущиеДанные.СтатусПроживания 		= Неопределено; 
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере 
Функция ПолучитьТипКвартиры()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Квартира",Объект.ЛицевойСчет.Квартира);
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		Момент = Объект.Дата;
	Иначе
		Момент = ТекущаяДата();
	КонецЕсли; 
	
	ТипКвартиры  = РегистрыСведений.бит_СведенияОКвартире.ПолучитьПоследнее(Момент, Отбор);
	
	Возврат ТипКвартиры.ТипКвартиры;
	
КонецФункции

&НаСервере
// Возвращает признак коммунальной квартиры, булево.
Функция ПолучитьПризнакТипаКвартиры()
	
	ТипКвартиры = ПолучитьТипКвартиры();
	Если ТипКвартиры = Справочники.бит_ТипыКвартиры.Коммунальная Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли; 
	
КонецФункции

&НаСервере 
// Функция получения данных квартир по реквизитам документа - здание, номер квартиры, дата.
// Используется, если квартира коммунальная. 
Функция ПолучитьДанныеКоммунальныхКвартир()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЕдиныйЖилДокумент.Дата КАК Дата,
	|	бит_ЕдиныйЖилДокумент.ЛицевойСчет.Здание КАК Здание,
	|	бит_ЕдиныйЖилДокумент.ЛицевойСчет.Квартира.НомерКвартиры КАК НомерКвартиры
	|ИЗ
	|	Документ.бит_ЕдиныйЖилДокумент КАК бит_ЕдиныйЖилДокумент
	|ГДЕ
	|	бит_ЕдиныйЖилДокумент.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Здание 		= Выборка.Здание;
		НомерКвартиры	= Выборка.НомерКвартиры;
		Момент			= Выборка.Дата;
		
	Иначе
		Здание 		= Справочники.бит_СписокЗданий.ПустаяСсылка();
		НомерКвартиры	= 0;
		Момент			= Дата("00010101");
		
	КонецЕсли;
	
	ДанныеКоммунальныхКомнат = бит_ПаспортныйСтолСервер.ПолучитьДанныеКоммунальныхКвартир(Здание, НомерКвартиры, Момент);
	
	Возврат ДанныеКоммунальныхКомнат;
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	Документ       = Метаданные.Документы.бит_ЕдиныйЖилДокумент;
	// Общие переменные.
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции

&НаСервере
// Функция формирует список физ лиц, когда-либо прописанных на ЛС (ВесьСписок = Ложь).
// Либо тех, кто прописан на момент даты документа (ВесьСписок = Истина).
Функция  СписокПроживающих(ЛС = Неопределено, ВесьСписок = Ложь)  
	
	Если ВесьСписок Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
		
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Момент = Объект.Дата;
		
	Иначе
		
		Момент = ТекущаяДата();
		
	КонецЕсли;
	
	Если Объект.СправкаПоСмерти Тогда
		Если ЗначениеЗаполнено(Объект.ДатаСмерти) Тогда
			
			Момент  = Объект.ДатаСмерти + 10*24*60*60;
			
		Иначе
			Момент = Объект.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Момент));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	
	СписокФизЛиц = Запрос.Выполнить().Выгрузить();
	
	ЭтаФорма.Элементы.ФизЛицо.СписокВыбора.ЗагрузитьЗначения(СписокФизЛиц.ВыгрузитьКолонку("ФизическоеЛицо"));
	
	Возврат СписокФизЛиц;
	
КонецФункции

&НаСервере
// Процедура формирует список физ лиц, когда-либо прописанных на ЛС (ВесьСписок = Ложь).
// Либо тех, кто прописан на момент даты документа (ВесьСписок = Истина).
Процедура  СписокПроживающихЛиц(ЛС = Неопределено, ВесьСписок = Ложь)  
	
	Если ВесьСписок Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Дата
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
		
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		
		Момент = Объект.Дата;
		
	Иначе
		
		Момент = ТекущаяДата();
		
	КонецЕсли;
	
	Если Объект.СправкаПоСмерти Тогда
		Если ЗначениеЗаполнено(Объект.ДатаСмерти) Тогда
			
			Момент  = Объект.ДатаСмерти + 10*24*60*60;
			
		Иначе
			Момент = Объект.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Момент));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛС);
	
	СписокФизЛиц = Запрос.Выполнить().Выгрузить();
	
	ЭтаФорма.Элементы.ФизЛицо.СписокВыбора.ЗагрузитьЗначения(СписокФизЛиц.ВыгрузитьКолонку("ФизическоеЛицо"));
	
	мСписокФизЛиц = СписокФизЛиц;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(СписокФизЛиц,УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура ЗагрузкаТабЧасти(СписокЗначенийФизЛиц, Дата = Неопределено)
	Если ЗначениеЗаполнено(Дата) Тогда
		
		мТаблицаФизЛиц.Загрузить(ФормированиеДанныхТабЧасти(СписокЗначенийФизЛиц, Дата));
		Объект.ФизическиеЛица.Загрузить(мТаблицаФизЛиц.Выгрузить());
		
	КонецЕсли; 
	
КонецПроцедуры	

&НаСервере

// Процедура формирования данных физ лиц
// Для заполнения таб части документа
// Параметры
//   СписокЗначенийФизЛиц - <список значений, таблица значений> - список физлиц.
//
Функция ФормированиеДанныхТабЧасти(СписокЗначенийФизЛиц, Момент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизическоеЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК РодственныеОтношения,
	|	бит_ПроживающиеПоЛССрезПоследних.ОткудаПрибыл,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаПрибытия,
	|	бит_ПроживающиеПоЛССрезПоследних.КудаВыписан,
	|	ВЫБОР
	|		КОГДА бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Метка,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПравоНаЛьготы КАК ПравоНаЛьготы,
	|	ВЫБОР
	|		КОГДА бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрописанНаМомент
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ФизЛицо В (&ФизЛицо)
	|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_ПроживающиеПоЛССрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метка";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("ФизЛицо", СписокЗначенийФизЛиц);
	Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
КонецФункции

Функция ПолучитьТабличнуюЧасть()
	ТабЗначений =  Объект.ФизическиеЛица.Выгрузить();	
	Возврат ТабЗначений;
КонецФункции

&НаСервере
Функция Сформировать()
	
	Если Объект.ФизЛицо = Неопределено ИЛИ Объект.ЛицевойСчет = Неопределено ИЛИ Объект.Организация = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Объект.СправкаПоСмерти И НЕ ЗначениеЗаполнено(Объект.ДатаСмерти) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Заполните поле ""Дата смерти""!!!";
		Сообщение.Сообщить();
		
		Возврат Результат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		Момент = Объект.Дата;
	Иначе
		Момент = ТекущаяДата();
	КонецЕсли;
	
	Если Объект.СправкаПоСмерти Тогда
		Если ЗначениеЗаполнено(Объект.ДатаСмерти) Тогда
			
			Момент  = Объект.ДатаСмерти + 10*24*60*60;
			
		Иначе
			Момент = Объект.Дата;
		КонецЕсли;
		
	КонецЕсли;
	
	ФизЛицо     = Объект.ФизЛицо;
	ЛицевойСчет = Объект.ЛицевойСчет;
	Организация = Объект.Организация;
	ЗаполнятьПаспортныеДанные = Объект.ЗаполнятьПаспортныеДанные;
	
	// Список физ диц из табличной части  ФизическиеЛица.
	ФизЛицаТЧ = Объект.ФизическиеЛица.Выгрузить(,"ФизическоеЛицо");
	
	// Добавление в таблицу строки из поля ФизЛицо.
	Если ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		ФизЛицоИзШапки = ФизЛицаТЧ.Найти(ФизЛицо);
		
		Если ФизЛицоИзШапки = Неопределено Тогда
			Индекс = ФизЛицаТЧ.Количество()-1; 
			Строка = ФизЛицаТЧ.Вставить(Индекс);
			Строка.ФизическоеЛицо = ФизЛицо;
		КонецЕсли; 
		
	КонецЕсли;
	// Полные личные данные о всех физ лицах документа из запроса, прописанных по ЛС.
	ТаблицаФизЛиц = ФормированиеДанныхТабЧасти(ФизЛицаТЧ, Момент);
	
	Результат.Очистить();                   
	
	Макет = Документы.бит_ЕдиныйЖилДокумент.ПолучитьМакет("ЕдиныйЖилищныйДокумент");
	
	ОбластьШапка        			= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаСобственников  		= Макет.ПолучитьОбласть("ШапкаСобственников");
	ОбластьСтрокаСобственников 		= Макет.ПолучитьОбласть("СтрокаСобственников");
	ОбластьПодвалСобственников  	= Макет.ПолучитьОбласть("ПодвалСобственников");
	ОбластьХарактеристикаКв1   		= Макет.ПолучитьОбласть("ХарактеристикаКв1");
	ОбластьШапкаКомнат   			= Макет.ПолучитьОбласть("ШапкаКомнат");
	ОбластьСтрокаКомнат   			= Макет.ПолучитьОбласть("СтрокаКомнат");
	ОбластьХарактеристикаКв2   		= Макет.ПолучитьОбласть("ХарактеристикаКв2");
	ОбластьЗаголовокПроживающих 	= Макет.ПолучитьОбласть("ЗаголовокПроживающих");
	ОбластьШапкаПроживающихТЧ 		= Макет.ПолучитьОбласть("ШапкаПроживающихТЧ");
	ОбластьСтрокаПроживающих 		= Макет.ПолучитьОбласть("СтрокаПроживающих");
	ОбластьШапкаПребывающих 		= Макет.ПолучитьОбласть("ШапкаПребывающих");
	ОбластьСтрокаЗарегистрированных = Макет.ПолучитьОбласть("СтрокаЗарегистрированных");
	ОбластьНаличиеДрЖилья 			= Макет.ПолучитьОбласть("НаличиеДрЖилья");
	ОбластьШапкаЛьгот 				= Макет.ПолучитьОбласть("ШапкаЛьгот");
	ОбластьСтрокаЛьгот 				= Макет.ПолучитьОбласть("СтрокаЛьгот");
	ОбластьСтрокаСоцЗащита 			= Макет.ПолучитьОбласть("СтрокаСоцЗащита");
	ОбластьСтрокаПриборовУчета 		= Макет.ПолучитьОбласть("СтрокаПриборовУчета");
	ОбластьСтрокаДолгов 			= Макет.ПолучитьОбласть("СтрокаДолгов");
	
	ОбластьСтрокаУслугДолгов 		= Макет.ПолучитьОбласть("СтрокаУслугДолгов");
	
	ОбластьШапкаКоммунальныхКв 		= Макет.ПолучитьОбласть("ШапкаКоммунальныхКв");
	ОбластьШапкаКоммунальныхКвТЧ 	= Макет.ПолучитьОбласть("ШапкаКоммунальныхКвТЧ");
	ОбластьСтрокаКоммунальныхКв 	= Макет.ПолучитьОбласть("СтрокаКоммунальныхКв");
	
	ОбластьСтрокаКоммунальныхКвТЧ 	= Макет.ПолучитьОбласть("СтрокаКоммунальныхКвТЧ");
	ОбластьПодвал 					= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьПустаяСтрока 			= Макет.ПолучитьОбласть("ПустаяСтрока");
	
	// Создание зачеркнутого шрифта.
	ЗачеркнутыйШрифт = Новый Шрифт(Макет.Область("непригодна").Шрифт,,,,,,Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.Район КАК Район,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.Улица КАК УлицаЛС,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.Ссылка КАК ДомЛС,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.Корпус КАК КорпусЛС,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира КАК КвартираЛС,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.Строение КАК СтроениеЛС,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Этаж КАК ЭтажКв,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ЖилаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.МОП,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.СовокупнаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.ТипПлиты,
	|	бит_СведенияОКвартиреСрезПоследних.ТипЗапирающегоУстройства,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.Организация.НаименованиеПолное КАК ПолноеНаименованиеОрганизации,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.КоличествоКомнат КАК КолвоКомнат,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.Улица.СтароеНаименование КАК УлицаЛСБыв,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.КонструкцияСтен КАК Стены,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.ДатаВводаВЭксплуатацию КАК ГодПостройки,
	|	бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец.ВидБлагоустройстваЗданий КАК ЛифтНаличие,
	|	ВложенныйЗапрос.МаксЭтажЗдания
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Момент, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета КАК ОбъектУчета,
	|			МАКСИМУМ(ВЫБОР
	|					КОГДА бит_ЗначениеСвойствОбъектовУчета.ВидСвойства = ЗНАЧЕНИЕ(ПланВидовХарактеристик.бит_СвойстваОбъектовУчета.КоличествоЭтажей)
	|						ТОГДА ЕСТЬNULL(бит_ЗначениеСвойствОбъектовУчета.Значение, 0)
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК МаксЭтажЗдания
	|		ИЗ
	|			РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК бит_ЗначениеСвойствОбъектовУчета
	|		ГДЕ
	|			бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета = &ОбъектУчета
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_ЗначениеСвойствОбъектовУчета.ОбъектУчета) КАК ВложенныйЗапрос
	|		ПО бит_СведенияОКвартиреСрезПоследних.Квартира.Владелец = ВложенныйЗапрос.ОбъектУчета";
	
	Запрос.УстановитьПараметр("Квартира"   , ЛицевойСчет.Квартира);
	Запрос.УстановитьПараметр("Момент"     , Момент);
	Запрос.УстановитьПараметр("ОбъектУчета", ЛицевойСчет.Здание);
	
	ДанныеЛС = Запрос.Выполнить().Выгрузить();
	
	ДанныеИтогЛС = Неопределено;
	
	Если ДанныеЛС.Количество() > 0 Тогда
		
		ДанныеИтогЛС = ДанныеЛС[0];
		ОбластьШапка.Параметры.Заполнить(ДанныеИтогЛС);
		
		Если ЗначениеЗаполнено(ДанныеИтогЛС.УлицаЛСБыв) Тогда
			ОбластьШапка.Параметры.ДомЛСБыв 	= ДанныеИтогЛС.ДомЛС;
			ОбластьШапка.Параметры.КорпусЛСБыв 	= ДанныеИтогЛС.КорпусЛС;
			ОбластьШапка.Параметры.СтроениеЛСБыв = ДанныеИтогЛС.СтроениеЛС;
			ОбластьШапка.Параметры.КвартираЛСБыв = ДанныеИтогЛС.КвартираЛС;
		КонецЕсли; 
		
		ОбластьХарактеристикаКв1.Параметры.Заполнить(ДанныеИтогЛС);
		ОбластьХарактеристикаКв1.Параметры.ПлощадьЖилаяИвнешняя = ДанныеИтогЛС.ЖилаяПлощадь;
		ОбластьХарактеристикаКв2.Параметры.Заполнить(ДанныеИтогЛС);
		
		ОбластьШапка.Параметры.Заполнить(Объект);
		
		Если Объект.СправкаПоСмерти Тогда
			
			ОбластьШапка.Параметры.НачалоПериода = Момент - 40*24*60*60;
			ОбластьШапка.Параметры.КонецПериода  = Момент ;
			
			ОбластьШапка.Параметры.Дата = Дата(0001,01,01);
			ОбластьШапка.Область("ПоСостоянию").Шрифт = ЗачеркнутыйШрифт;
			
		Иначе
			
			ОбластьШапка.Параметры.Дата = Момент;
			ОбластьШапка.Область("ЗаПериод").Шрифт = ЗачеркнутыйШрифт;
			ОбластьШапка.Параметры.НачалоПериода 	= Дата(0001,01,01);
			ОбластьШапка.Параметры.КонецПериода 	= Дата(0001,01,01) ;
			
		КонецЕсли; 
	КонецЕсли;
	
	ФИОЗаявителя   = бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(ФизЛицо, Момент, Ложь);
	
	ТелефонФизЛица = бит_ПаспортныйСтолСервер.ПолучитьТелефонИзКонтактнойИнформации(ФизЛицо);
	
	Если ЗначениеЗаполнено(ФИОЗаявителя) Тогда
		ФИОЗаявителя  = ФИОЗаявителя + ?(ЗначениеЗаполнено(ТелефонФизЛица),", тел." + Строка(ТелефонФизЛица),"");
	Иначе
		ФИОЗаявителя  = Строка(Объект.ФизЛицо)+ ?(ЗначениеЗаполнено(ТелефонФизЛица),", тел." + Строка(ТелефонФизЛица),"");
	КонецЕсли; 
	
	ОбластьШапка.Параметры.ФизЛицо = ФИОЗаявителя;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ЮрАдресОрганизации"));
	
	Адрес = Организация.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Адрес.количество() > 0 Тогда
		ЮрАдресОрганизацииТЗ = Адрес[0].Представление;	
	Иначе
		ЮрАдресОрганизацииТЗ = "";	
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Вид",ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонОрганизации"));
	
	Телефон = Организация.КонтактнаяИнформация.НайтиСтроки(Отбор);
	
	Если Телефон.количество() > 0 Тогда
		ТелефонОрганизации = Телефон[0].Представление;	
	Иначе
		ТелефонОрганизации = "";	
	КонецЕсли;
	
	ПолныеДанныеОрганизации = Объект.Организация.НаименованиеПолное 
	+ ?(ЗначениеЗаполнено(ЮрАдресОрганизацииТЗ),", " + ЮрАдресОрганизацииТЗ ,"")
	+ ?(ЗначениеЗаполнено(ТелефонОрганизации),", тел." + ТелефонОрганизации,"");
	ОбластьШапка.Параметры.ПолныеДанныеОрганизации = ПолныеДанныеОрганизации;
	
	// Заполнение паспортных данных. 
	Если ЗаполнятьПаспортныеДанные И ЗначениеЗаполнено(ФизЛицо) Тогда
		ДанныеПаспорта_1 = "";
		ДанныеПаспорта_2 = "";
		ДанныеПаспортаПредыд = "";
		ПричинаЗаменыПаспорта = "";
		
		ТекущийДокФизЛица 	= бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокой(ФизЛицо,Момент);
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ТекущийДокФизЛица, 55, ДанныеПаспорта_1, ДанныеПаспорта_2);
		
		ДокФизЛица 			= бит_ПаспортныйСтолСервер.ПолучитьДанныеРанееВыданногоДокументаФизЛица(ФизЛицо, Момент);
		Если ЗначениеЗаполнено(ДокФизЛица.ДокументВид) Тогда
			ДанныеПаспортаПредыд = бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокойИзСтруктуры(ДокФизЛица);
			Если ЗначениеЗаполнено(ТекущийДокФизЛица) Тогда
				
				ПричинаЗаменыПаспортаСтрукт = бит_ПаспортныйСтолСервер.ПолучитьДанныеДокументаФизЛица(ФизЛицо, Момент);
				ПричинаЗаменыПаспорта 		= ПричинаЗаменыПаспортаСтрукт.ДокументПричинаЗамены;	
				
			КонецЕсли; 
		КонецЕсли;
		
		// Создание структуры для заполнения данных.
		СтруктураДанных = Новый Структура("ДанныеПаспорта_1, ДанныеПаспорта_2,ДанныеПаспортаПредыд,ПричинаЗаменыПаспорта"
		,ДанныеПаспорта_1,ДанныеПаспорта_2,ДанныеПаспортаПредыд, ПричинаЗаменыПаспорта);
		
		ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
		
	КонецЕсли; 
	
	Ответственный = ОтветственныйНаЛС(ЛицевойСчет,Момент);
	
	ОтветственныйЛС = "";

	Попытка
		ИсходСклонения =  бит_ПаспортныйСтолСервер.Просклонять(Строка(Ответственный),2,Ответственный.Пол,ОтветственныйЛС);
	Исключение
		ИсходСклонения = Ложь;
	КонецПопытки;
	
	Если НЕ ИсходСклонения Тогда
		ОтветственныйЛС = Строка(Ответственный);
	КонецЕсли; 
	ОбластьШапка.Параметры.ОтветственныйЛС = ОтветственныйЛС;
	
	Результат.Вывести(ОбластьШапка);
	
	// Список владельцев квартиры.
	МассивВладельцевПолн = Неопределено;
	
	ТаблицаПроживающихПоЛС = бит_ПаспортныйСтолСервер.ПолучитьСписокПроживающихПоЛС(ЛицевойСчет, Момент, Ложь);
	Если ТаблицаПроживающихПоЛС.Количество() > 0 Тогда 
		Отбор = Новый Структура();
		Отбор.Вставить("ВладелецКвартиры",Перечисления.ДаНет.Да);
		
		МассивВладельцевПолн = ТаблицаПроживающихПоЛС.НайтиСтроки(Отбор);
	КонецЕсли;
	
	МассивВладельцев = Новый Массив;
	Индекс = 0;
	
	Если НЕ МассивВладельцевПолн = Неопределено Тогда
		
		Для каждого Строка Из МассивВладельцевПолн Цикл
			
			Если Строка.СтатусФизЛица <> Справочники.бит_СтатусФизЛица.Выписан Тогда
				МассивВладельцев.Вставить(Индекс,Строка);
				Индекс = Индекс + 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если МассивВладельцев.Количество()> 0 Тогда
		
		Счетчик = 1;
		Пока Счетчик < 3 Цикл 
			Для каждого СтрокаВладелец Из МассивВладельцев Цикл
				
				СокращенноеФИО  			= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(СтрокаВладелец.ФизЛицо, Момент,,Ложь);
				Если НЕ ЗначениеЗаполнено(СокращенноеФИО) Тогда
					СокращенноеФИО 		= Строка(СтрокаВладелец.ФизЛицо);
				КонецЕсли;
				
				Если Счетчик = 1 Тогда
					
					ОбластьШапкаСобственников.Параметры.ФиоСобственника_1 = СокращенноеФИО;
					ОбластьШапкаСобственников.Параметры.Доля_1 = СтрокаВладелец.ДоляПлощади;
					
				КонецЕсли;
				
				Если Счетчик = 2 и МассивВладельцев.Количество()> 1 Тогда
					
					ОбластьШапкаСобственников.Параметры.НомСобственника = Строка(Счетчик) + ".";
					ОбластьШапкаСобственников.Параметры.ФиоСобственника_2 = СтрокаВладелец.ФизЛицо;
					ОбластьШапкаСобственников.Параметры.Доля_2 = СтрокаВладелец.ДоляПлощади;
					
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				
			КонецЦикла;
		КонецЦикла;
		
		Результат.Вывести(ОбластьШапкаСобственников);
	КонецЕсли; 
	
	Если МассивВладельцев.Количество()> 2 Тогда
		Счетчик = 1;
		Для каждого СтрокаВладелец Из МассивВладельцев Цикл
			
			
			Если Счетчик > 2 Тогда
				
				СокращенноеФИО  			= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(СтрокаВладелец.ФизЛицо, Момент, ,Ложь);
				
				Если НЕ ЗначениеЗаполнено(СокращенноеФИО) Тогда
					
					СокращенноеФИО 		= Строка(СтрокаВладелец.ФизЛицо);
					
				КонецЕсли;
				
				ОбластьСтрокаСобственников.Параметры.НомСобственника = Строка(Счетчик) + ".";
				ОбластьСтрокаСобственников.Параметры.ФиоСобственника = СокращенноеФИО;
				ОбластьСтрокаСобственников.Параметры.Доля			 = СтрокаВладелец.ДоляПлощади;
				Результат.Вывести(ОбластьСтрокаСобственников);
				
			КонецЕсли; 
			
			Счетчик = Счетчик + 1;
			
			
		КонецЦикла; 
	КонецЕсли; 
	
	ДокументОснование_1 = "";
	ДокументОснование_2 = "";
	ДокументОснование = "";
	ОтветственныйСтрока = ТаблицаПроживающихПоЛС.Найти(Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо,"СтепеньРодства");
	Если ОтветственныйСтрока <> Неопределено Тогда
		
		ДанныеДокумента  	= ОтветственныйСтрока.ПравоустанавливающиеДокументы;
		ДокументОснование 	= ДанныеДокумента.Наименование + " " +  ДанныеДокумента.НомерДокумента
		+ " от " + Формат(ДанныеДокумента.ДатаДокумента,"ДФ='dd.MM.yyyy ""г.""'")
		+ ?(ЗначениеЗаполнено(ДанныеДокумента.ОрганизацияВыдавшаяДокумент),", выд. " + Строка(ДанныеДокумента.ОрганизацияВыдавшаяДокумент),"");
	КонецЕсли;
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ДокументОснование,70,ДокументОснование_1,ДокументОснование_2);
	ОбластьПодвалСобственников.Параметры.ДокументОснование_1 = ДокументОснование_1;
	ОбластьПодвалСобственников.Параметры.ДокументОснование_2 = ДокументОснование_2;
	Результат.Вывести(ОбластьПодвалСобственников);
	
	// Заполнение характеристик квартиры.
	КомнатыКвартиры = бит_ПаспортныйСтолСервер.ПолучитьДанныеКомнатКвартиры(ЛицевойСчет.Квартира, Момент);
	Если КомнатыКвартиры.Количество() > 0 Тогда
		
		ПлощадьКухни 	= бит_ПаспортныйСтолСервер.ПолучитьПлощадьКухни(КомнатыКвартиры);
		ПлощадиКомнат 	= бит_ПаспортныйСтолСервер.ПолучитьПлощадиКвартирыИзКомнат(КомнатыКвартиры);
		
		ОбластьХарактеристикаКв1.Параметры.ПлощадьКухни 	= ПлощадьКухни;
		ОбластьХарактеристикаКв1.Параметры.ПлощадьВнешняя 	= ПлощадиКомнат[5];
		ОбластьХарактеристикаКв1.Параметры.ПлощадьЖилаяИвнешняя 	= ПлощадиКомнат[5]+ПлощадиКомнат[1];
		
	КонецЕсли; 
	Результат.Вывести(ОбластьХарактеристикаКв1);
	Результат.Вывести(ОбластьШапкаКомнат);
	
	// Заполнение списка комнат.
	Если КомнатыКвартиры.Количество()>0 Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ТипКомнаты",Справочники.бит_ТипыКомнат.Жилая);
		ЖилыеКомнаты = КомнатыКвартиры.НайтиСтроки(Отбор);
		Индекс = 1;
		Для каждого Комната Из ЖилыеКомнаты Цикл
			ОбластьСтрокаКомнат.Параметры.НомерКомнаты = Индекс;
			ОбластьСтрокаКомнат.Параметры.ПлощадьКомнаты = Комната.Площадь;
			
			Если Комната.ЧастьПомещения.Ссылка = Справочники.бит_НазначениеЧастейПомещения.Комната Тогда
				ОбластьСтрокаКомнат.Параметры.ТипЖилойКомнаты = Строка(Комната.ЧастьПомещения.Ссылка);
			КонецЕсли; 
			
			Если Комната.ЧастьПомещения.Ссылка = Справочники.бит_НазначениеЧастейПомещения.КомнатаЗапроходная Тогда
				ОбластьСтрокаКомнат.Параметры.ТипЖилойКомнаты = Строка(Комната.ЧастьПомещения.Ссылка);
			КонецЕсли; 
			
			Если Комната.ЧастьПомещения.Ссылка = Справочники.бит_НазначениеЧастейПомещения.КомнатаПроходная Тогда
				ОбластьСтрокаКомнат.Параметры.ТипЖилойКомнаты = Строка(Комната.ЧастьПомещения.Ссылка);
			КонецЕсли; 
			Индекс = Индекс +1;
			Результат.Вывести(ОбластьСтрокаКомнат);
		КонецЦикла; 
	КонецЕсли;                 
	
	// Заполнение услугами.
	ОбластьХарактеристикаКв2.Параметры.СерияДома = Объект.СерияДома;
	СписокУслуг = бит_ПаспортныйСтолСервер.ПолучитьСписокУслугПоЛС(ЛицевойСчет,Момент);
	
	Отопление 				= Перечисления.ДаНет.Нет;
	Водопровод 				= Перечисления.ДаНет.Нет;
	Электроэнергия 			= Перечисления.ДаНет.Нет;
	Газ 					= Перечисления.ДаНет.Нет;
	ГорячееВодоснобжение 	= Перечисления.ДаНет.Нет;
	
	Если СписокУслуг.Количество() > 0 Тогда
		
		Для каждого Строка Из СписокУслуг Цикл
			Если Строка.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Водопровод Тогда
				Водопровод 				= Перечисления.ДаНет.Да;
			КонецЕсли; 
			
			Если Строка.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Отопление Тогда
				Отопление 				= Перечисления.ДаНет.Да;
			КонецЕсли; 
			
			Если Строка.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Электроэнергия Тогда
				Электроэнергия			= Перечисления.ДаНет.Да;
			КонецЕсли;
			
			Если Строка.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.Газ Тогда
				Газ		 				= Перечисления.ДаНет.Да;
			КонецЕсли; 
			
			Если Строка.ГрафаОтчетаГЦЖС = Перечисления.бит_ГрафыОтчетаПоГЦЖС.ГорячееВодоснобжение Тогда
				ГорячееВодоснобжение	= Перечисления.ДаНет.Да;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ДанныеИтогЛС <> Неопределено Тогда
		
		Если ДанныеИтогЛС.ТипПлиты = Справочники.бит_ТипыПлиты.ГазоваяПлита Тогда
			
			Газ		 				= Перечисления.ДаНет.Да;
			
		ИначеЕсли ДанныеИтогЛС.ТипПлиты = Справочники.бит_ТипыПлиты.ЭлектрическаяПлита Тогда
			
			Электроэнергия			= Перечисления.ДаНет.Да;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Лифт = Перечисления.ДаНет.Нет;
	Если ЗначениеЗаполнено(ЛицевойСчет.Здание)И ЗначениеЗаполнено(ЛицевойСчет.Здание.ВидБлагоустройстваЗданий) Тогда
		Если ЛицевойСчет.Здание.ВидБлагоустройстваЗданий = Справочники.бит_ВидыБлагоустройстваЗданий.СЛифтами Тогда
			Лифт = Перечисления.ДаНет.Да;
		КонецЕсли;
		
	КонецЕсли; 
	Благоустройство = Объект.СоответствиеСтандартамБлагоустройства;
	Если Объект.ТипСистемыГВС Тогда
		
		ТипГВС = "открытая";
		
	Иначе
		
		ТипГВС = "закрытая";
		
	КонецЕсли;
	
	СтруктураУслуг = Новый Структура("Отопление, Водопровод,Электроэнергия,Газ,ГорячееВодоснобжение,Лифт,ТипГВС,Благоустройство",
	Отопление, Водопровод,Электроэнергия,Газ,ГорячееВодоснобжение,Лифт,ТипГВС,Благоустройство);
	ЗаполнитьЗначенияСвойств( ОбластьХарактеристикаКв2.Параметры,СтруктураУслуг);
	
	Если Объект.ПригодностьДляЖилья Тогда
		
		ОбластьХарактеристикаКв2.Область("непригодна").Шрифт = ЗачеркнутыйШрифт;
		
	Иначе
		
		ОбластьХарактеристикаКв2.Область("пригодна").Шрифт = ЗачеркнутыйШрифт;
		
	КонецЕсли; 
	
	Результат.Вывести(ОбластьХарактеристикаКв2);
	
	Если Объект.Новостройка Тогда
		
		ОбластьЗаголовокПроживающих.Область("неновостройка").Шрифт = ЗачеркнутыйШрифт;
		
	Иначе
		ОбластьЗаголовокПроживающих.Область("новостройка1").Шрифт = ЗачеркнутыйШрифт;
		ОбластьЗаголовокПроживающих.Область("новостройка2").Шрифт = ЗачеркнутыйШрифт;
		
	КонецЕсли; 
	
	Результат.Вывести(ОбластьЗаголовокПроживающих);
	
	Результат.Вывести(ОбластьШапкаПроживающихТЧ);
	
	// Заполнение данных по проживающим.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизЛицо", Объект.ФизическиеЛица.Выгрузить(,"ФизическоеЛицо").ВыгрузитьКолонку("ФизическоеЛицо"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(, ФизЛицо В (&ФизЛицо)) КАК бит_ПроживающиеПоЛССрезПоследних";

	ТЗДатаРегистрации = Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка Из Объект.ФизическиеЛица Цикл
		
		Если  Строка.СтатусПроживания = Перечисления.бит_СтатусПроживания.Постоянно  Тогда
			
			ОбластьСтрокаПроживающих.Параметры.Заполнить(Строка);
			
			// Требование отображать полностью.
			//СокращенноеФИО  			= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Строка.ФизическоеЛицо, Момент, ,Ложь);
			//Если НЕ ЗначениеЗаполнено(СокращенноеФИО) Тогда
			//	СокращенноеФИО 		= Строка(Строка.ФизическоеЛицо);
			//КонецЕсли;
			//ОбластьСтрокаПроживающих.Параметры.ФизическоеЛицо = СокращенноеФИО;	
			ОбластьСтрокаПроживающих.Параметры.ФизическоеЛицо = Строка(Строка.ФизическоеЛицо);	
			
			Если ЗначениеЗаполнено(Строка.ФизическоеЛицо.МестоРождения) Тогда
				МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Строка.ФизическоеЛицо.МестоРождения);
			Иначе
				МестоРождения = "";
			КонецЕсли;
			ОбластьСтрокаПроживающих.Параметры.МестоРождения = МестоРождения;
			
			
			ТекущийДокФизЛица 	= бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокой(Строка.ФизическоеЛицо,Момент);

			ОбластьСтрокаПроживающих.Параметры.ПаспортныеДанные = ТекущийДокФизЛица;
			
			ДокФизЛица 			= бит_ПаспортныйСтолСервер.ПолучитьДанныеРанееВыданногоДокументаФизЛица(Строка.ФизическоеЛицо, Момент);
			Если ЗначениеЗаполнено(ДокФизЛица.ДокументВид) Тогда
				ДанныеПаспортаПредыд = бит_ПаспортныйСтолСервер.ПолучитьПаспортныеДанныеСтрокойИзСтруктуры(ДокФизЛица);
			Иначе
				ДанныеПаспортаПредыд = "";
			КонецЕсли;
			ОбластьСтрокаПроживающих.Параметры.ПаспортДанныеПрежние = ДанныеПаспортаПредыд;
			
			ДанныеПоСрокуПрописки = ТЗДатаРегистрации.НайтиСтроки(Новый Структура("ФизЛицо",Строка.ФизическоеЛицо));
			Если ДанныеПоСрокуПрописки.Количество()> 0 Тогда
				СрокПроживания = ДанныеПоСрокуПрописки[0].ДатаРегистрации
			Иначе
				СрокПроживания = Дата(0001,01,01);
			КонецЕсли;
			
			//Отбор = Новый Структура;
			//Отбор.Вставить("ФизЛицо",Строка.ФизическоеЛицо);
			//ДанныеПоСрокуПрописки = РегистрыСведений.бит_ПроживающиеПоЛС.СрезПоследних(Дата(0001,01,02),Отбор);
			//Если ДанныеПоСрокуПрописки.Количество()> 0 Тогда
			//	
			//	СрокПроживания = ДанныеПоСрокуПрописки[0].ДатаРегистрации
			//	
			//Иначе
			//	
			//	СрокПроживания = Дата(0001,01,01);
			//	
			//КонецЕсли;
			ОбластьСтрокаПроживающих.Параметры.СрокПроживания = СрокПроживания;
			// Данные по тем физ лицам, по которым есть записи по регистрам в базе.
			СтрокаПоиска = ТаблицаФизЛиц.Найти(Строка.ФизическоеЛицо, "ФизическоеЛицо");
			Если ЗначениеЗаполнено(СтрокаПоиска) Тогда
				ОбластьСтрокаПроживающих.Параметры.КудаВыписан 		= СтрокаПоиска.КудаВыписан;
				ОбластьСтрокаПроживающих.Параметры.ОткудаПрибыл 	= СтрокаПоиска.ОткудаПрибыл;
				
			КонецЕсли; 
			
			Разделитель = Новый Массив;
			
			Разделитель.Добавить(ОбластьСтрокаПроживающих);
			
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(Результат, Разделитель) Тогда
				
				Результат.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЕсли;
			
			Результат.Вывести(ОбластьСтрокаПроживающих);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если Объект.ФизическиеЛица.Количество() = 0 Тогда
		
		Результат.Вывести(ОбластьСтрокаПроживающих);
		
	КонецЕсли; 
	
	Результат.Вывести(ОбластьШапкаПребывающих);
	
	
	Для каждого Строка Из  Объект.ФизическиеЛица Цикл
		
		Если  Строка.СтатусПроживания = Перечисления.бит_СтатусПроживания.Временно  Тогда
			
			СокращенноеФИО  			= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Строка.ФизическоеЛицо, Момент, ,Ложь);
			Если НЕ ЗначениеЗаполнено(СокращенноеФИО) Тогда
				СокращенноеФИО 		= Строка(Строка.ФизическоеЛицо);
			КонецЕсли;
			ОбластьСтрокаЗарегистрированных.Параметры.ФизическоеЛицо = СокращенноеФИО;	
			Результат.Вывести(ОбластьСтрокаЗарегистрированных);
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если Объект.НаличиеДругогоЖилья Тогда
		
		ОбластьНаличиеДрЖилья.Параметры.НаличиеДрЖилья = "имеют";
	Иначе
		
		ОбластьНаличиеДрЖилья.Параметры.НаличиеДрЖилья = "не имеют";
		
	КонецЕсли;
	Результат.Вывести(ОбластьНаличиеДрЖилья);
	
	// Заполнения данных по льготам.
	Результат.Вывести(ОбластьШапкаЛьгот);
	ТаблицаЛьготников = бит_ПаспортныйСтолСервер.ПолучитьСписокЛьготниковПоЛС(ЛицевойСчет, Момент);
	Если ТаблицаЛьготников.Количество() > 0 Тогда
		СоцЗащитаФИО = "";
		Отбор = Новый Структура();
		Отбор.Вставить("ПравоНаЛьготы",Истина);
		ВременныйСписок = мТаблицаФизЛиц.НайтиСтроки(Отбор);
		
		Если ВременныйСписок.Количество()> 0 Тогда
			Для каждого СтрокаМассива Из ВременныйСписок Цикл
				Отбор = Новый Структура();
				Отбор.Вставить("ФизЛицо",СтрокаМассива.ФизическоеЛицо);
				СписокЛьготников = ТаблицаЛьготников.НайтиСтроки(Отбор);
				
				Если СписокЛьготников.Количество() = 0 Тогда
					СокращенноеФИО 			= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(СтрокаМассива.ФизическоеЛицо, Момент, ,Ложь);
					Если НЕ ЗначениеЗаполнено(СокращенноеФИО) Тогда
						СокращенноеФИО 		= Строка(СтрокаМассива.ФизическоеЛицо);
					КонецЕсли;
					
					СоцЗащитаФИО = ?(ЗначениеЗаполнено(СоцЗащитаФИО), СоцЗащитаФИО+ ", " + Строка(СокращенноеФИО),Строка(СокращенноеФИО));
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		НачалоПериода = НачалоМесяца(ДобавитьМесяц(Момент, -1));
		КонецПериода = КонецМесяца(ДобавитьМесяц(Момент,-1));
		Для каждого Строка  Из ТаблицаЛьготников Цикл
			
			ОбластьСтрокаЛьгот.Параметры.Заполнить(Строка);
			
			СокращенноеФИО  			= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Строка.ФизЛицо, Момент, ,Ложь);
			Если ЗначениеЗаполнено(СокращенноеФИО) Тогда
				
				ОбластьСтрокаЛьгот.Параметры.ФизЛицо	= СокращенноеФИО;
				
			Иначе	
				ОбластьСтрокаЛьгот.Параметры.ФизЛицо	= Строка.ФизЛицо;
				
			КонецЕсли;
			ОбластьСтрокаЛьгот.Параметры.ЛьготДокДень  	= День(Строка.Период);
			ОбластьСтрокаЛьгот.Параметры.ЛьготДокМесяц 	= Месяц(Строка.Период);
			ОбластьСтрокаЛьгот.Параметры.ЛьготДокГод   	= Формат(Строка.Период,"ДФ=yy");
			
			// Заполнение размера льготын скидок.
			РазмерЛьгот =  бит_ПаспортныйСтолСервер.ПолучитьРазмерЛьготыПоФизЛицу(Строка.ФизЛицо,Строка.Льгота, Момент);
			Если РазмерЛьгот.Количество() > 0 Тогда
				
				ЛьготаРазмер = РазмерЛьгот[0].СуммаЛьготы;
			Иначе
				ЛьготаРазмер = "";
			КонецЕсли;
			ОбластьСтрокаЛьгот.Параметры.ЛьготаРазмер = ЛьготаРазмер;
			
			Результат.Вывести(ОбластьСтрокаЛьгот);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СоцЗащитаФИО) Тогда
			
			ОбластьСтрокаСоцЗащита.Параметры.СоцЗащитаФИО = СоцЗащитаФИО;
			
		Иначе
			
			ОбластьСтрокаСоцЗащита.Параметры.СоцЗащитаФИО = Перечисления.ДаНет.Нет;
			
		КонецЕсли; 
		
		Результат.Вывести(ОбластьСтрокаСоцЗащита);
	КонецЕсли; 
	
	// Заполнение списка счетчиков.
	ПриборыУчета = "";
	ДанныеПоСчетчикам = бит_ПаспортныйСтолСервер.ПолучитьСписокСчетчиковНаЛС(ЛицевойСчет,Момент);
	Если ДанныеПоСчетчикам.Количество() > 0 Тогда
		
		ТаблицаУслуг = ДанныеПоСчетчикам.Скопировать(,"Услуга,ТипСчетчика");
		ТаблицаУслуг.Свернуть("Услуга,ТипСчетчика");
		СписокТипов = ДанныеПоСчетчикам.Скопировать(,"ТипСчетчика");
		СписокТипов.Свернуть("ТипСчетчика");
		
		Для каждого СтрокаТипов Из СписокТипов Цикл
			Отбор = Новый Структура();
			
			Отбор.Вставить("ТипСчетчика",СтрокаТипов.ТипСчетчика);
			МассивУслуг = ТаблицаУслуг.НайтиСтроки(Отбор);
			СписокУслуг = "";
			Для каждого СтрокаУслуг Из МассивУслуг Цикл
				
				СписокУслуг = ?(ЗначениеЗаполнено(СписокУслуг),СписокУслуг + ", " + Строка(СтрокаУслуг.Услуга),Строка(СтрокаУслуг.Услуга));
				
			КонецЦикла; 
			ПриборыУчета = ?(ЗначениеЗаполнено(ПриборыУчета),ПриборыУчета +"; "+ Строка(СтрокаТипов.ТипСчетчика)+ " - " + СписокУслуг,Строка(СтрокаТипов.ТипСчетчика)+ " - " + СписокУслуг);
		КонецЦикла; 
	КонецЕсли;
	Если ЗначениеЗаполнено(ПриборыУчета) Тогда
		
		ПриборыУчета = ПриборыУчета + ".";
		
	КонецЕсли; 
	ОбластьСтрокаПриборовУчета.Параметры.ПриборыУчета = ПриборыУчета;
	Результат.Вывести(ОбластьСтрокаПриборовУчета);
	
	// Заполнение задолжности.
	ДанныеНачальногоСальдо 	= бит_ПаспортныйСтолСервер.ПолучитьОстаткиПоУслугам(ЛицевойСчет, Момент);
	СуммаДолга 				= ДанныеНачальногоСальдо.Итог("СуммаОстаток");
	ДатаДолга = Формат(Момент,"ДЛФ=DD");
	ОбластьСтрокаДолгов.Параметры.ДатаДолга = ДатаДолга;
	
	Если НЕ Объект.СправкаПоСмерти Тогда
		Если СуммаДолга > 0 Тогда
			
			ОбластьСтрокаДолгов.Параметры.ДолгНаличие = "имеется";
			СписокУслугДолгов = "";
			Для каждого Строка Из ДанныеНачальногоСальдо Цикл
				Если Строка.СуммаОстаток > 0 Тогда
					
					СписокУслугДолгов = ?(ЗначениеЗаполнено(СписокУслугДолгов),СписокУслугДолгов + ", " + Строка(Строка.УслугаЖКХ),СписокУслугДолгов + Строка(Строка.УслугаЖКХ));
					
				КонецЕсли; 
				
			КонецЦикла;
			СписокУслугДолгов = ?(ЗначениеЗаполнено(СписокУслугДолгов),СписокУслугДолгов + ".",СписокУслугДолгов);
			Результат.Вывести(ОбластьСтрокаДолгов);     
			
			ОбластьСтрокаУслугДолгов.Параметры.СписокУслугДолгов = СписокУслугДолгов;
			Результат.Вывести(ОбластьСтрокаУслугДолгов);
			
		Иначе
			
			ОбластьСтрокаДолгов.Параметры.ДолгНаличие = "не имеется";
			Результат.Вывести(ОбластьСтрокаДолгов);                       
			
		КонецЕсли; 
		
	Иначе
		Результат.Вывести(ОбластьСтрокаДолгов);                       
		
	КонецЕсли; 
	
	// Вывод данных по куммунальной квартире.
	ПризнакКоммунальной = ПолучитьПризнакТипаКвартиры();	
	Если ПризнакКоммунальной Тогда		
		ОбластьШапкаКоммунальныхКв.Параметры.ПризнакКоммунальной = Перечисления.ДаНет.Да;	
		Результат.Вывести(ОбластьШапкаКоммунальныхКв);
		Результат.Вывести(ОбластьСтрокаКоммунальныхКв);
		Результат.Вывести(ОбластьШапкаКоммунальныхКвТЧ);
		
		Для каждого Строка Из Объект.Коммунальные Цикл
			ОбластьСтрокаКоммунальныхКвТЧ.Параметры.Заполнить(Строка);
			Если ЗначениеЗаполнено(Строка.Ответственный) Тогда
				
				СокращенноеФИО 	= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(Строка.Ответственный, Момент, ,Ложь);
				
			Иначе
				
				СокращенноеФИО 	= "свободная";
				
			КонецЕсли; 
			Если ЗначениеЗаполнено(СокращенноеФИО) Тогда
				
				ОбластьСтрокаКоммунальныхКвТЧ.Параметры.Ответственный = СокращенноеФИО;
				
			КонецЕсли;	
			Результат.Вывести(ОбластьСтрокаКоммунальныхКвТЧ);
		КонецЦикла; 
		
	Иначе
		
		ОбластьШапкаКоммунальныхКв.Параметры.ПризнакКоммунальной  = Перечисления.ДаНет.Нет; 
		
		Результат.Вывести(ОбластьШапкаКоммунальныхКв);
		Результат.Вывести(ОбластьПустаяСтрока);
		Результат.Вывести(ОбластьШапкаКоммунальныхКвТЧ);
		Результат.Вывести(ОбластьСтрокаКоммунальныхКвТЧ);
		
	КонецЕсли; 
	Результат.Вывести(ОбластьПустаяСтрока);
	
	// Вывод подвала.
	Если ЗначениеЗаполнено(Объект.ОтветственноеЛицоОрганизации) Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("СтруктурнаяЕдиница",Организация);
		Отбор.Вставить("ОтветственноеЛицо",Объект.ОтветственноеЛицоОрганизации);
		ОтветственноеЛицо = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Момент, Отбор);
		
		Если ОтветственноеЛицо.Количество() > 0 Тогда
			ДанныеОтветственного =  ОтветственноеЛицо[0];
			ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры,ДанныеОтветственного);
			
			СокращенноеФИО 			= бит_ПаспортныйСтолСервер.ПолучитьФИОФизЛица(ДанныеОтветственного.ФизическоеЛицо, Момент, ,Ложь);
			
			Если ЗначениеЗаполнено(СокращенноеФИО) Тогда
				
				ОбластьПодвал.Параметры.ФизическоеЛицо = СокращенноеФИО;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// Дата через 60 дней со дня выдачи док-та.
	ДатаДействияДокумента = Объект.Дата + 60*24*60*60;
	
	ОбластьПодвал.Параметры.День   	= День(ДатаДействияДокумента);
	ДатаМесяц 						= Формат(ДатаДействияДокумента,"ДФ='дд.MMMM'");
	ОбластьПодвал.Параметры.Месяц 	= Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));
	ОбластьПодвал.Параметры.Год     = Формат(ДатаДействияДокумента,"ДФ=yyyy");
	
	Результат.Вывести(ОбластьПодвал);
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СправкаПоСмертиПриИзменении(Элемент)
	
	Если Объект.СправкаПоСмерти Тогда
		ЭтаФорма.Элементы.ДатаСмерти.Видимость 		= Истина;
		ЭтаФорма.Элементы.ДатаСмерти.Доступность 	= Истина;
	Иначе
		ЭтаФорма.Элементы.ДатаСмерти.Видимость 		= Ложь;
		ЭтаФорма.Элементы.ДатаСмерти.Доступность 	= Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВесьСписокПриИзменении(Элемент)
	
	Если Объект.ФизическиеЛица.Количество() > 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыводитьВесьСписокПриИзмененииЗавершение", ЭтотОбъект), "Изменены настройки вывода списка проживающих. Табличная часть ""Проживающие"" будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ВыводитьВесьСписокПриИзмененииФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВесьСписокПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса ;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	
	ВыводитьВесьСписокПриИзмененииФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВесьСписокПриИзмененииФрагмент()
	
	Если Объект.ВыводитьВесьСписок Тогда
		
		СписокПроживающихЛиц(Объект.ЛицевойСчет, Истина);
		
	Иначе

		СписокПроживающихЛиц(Объект.ЛицевойСчет);
		
	КонецЕсли; 
	
	ЗаполнитьТабличнуюЧасть();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьФизическоеЛицоНаСервере(Знач ВыбранноеЗначение)
	
	ВременаяТабФизЛиц = ПолучитьТабличнуюЧасть();
	
	СтрокаТабличнойЧасти = ВременаяТабФизЛиц.Найти(ВыбранноеЗначение, "ФизическоеЛицо");
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		
		Если мТаблицаФизЛиц.Количество() > 0 Тогда	
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("ФизическоеЛицо", ВыбранноеЗначение);
			
			НайденныйМассив = мТаблицаФизЛиц.НайтиСтроки(Отбор);
			
			Если НайденныйМассив.Количество() > 0 Тогда
				
				НоваяСтрока = Объект.ФизическиеЛица.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденныйМассив[0]);
				
			Иначе
				
				НоваяСтрока = Объект.ФизическиеЛица.Добавить();
				
				НоваяСтрока.ФизическоеЛицо = ВыбранноеЗначение;
				НоваяСтрока.ДатаРождения   = ВыбранноеЗначение.ДатаРождения;
				
			КонецЕсли; 
			
		Иначе
			
			НоваяСтрока = Объект.ФизическиеЛица.Добавить();
			
			НоваяСтрока.ФизическоеЛицо = ВыбранноеЗначение;
			НоваяСтрока.ДатаРождения   = ВыбранноеЗначение.ДатаРождения;
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуРожденияНаСервере(Знач ФизЛицо)
	
	Возврат ФизЛицо.ДатаРождения;
	
КонецФункции

&НаСервере
Функция ОтветственныйНаЛС(ЛицевойСчет,Момент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&Момент,
	|			ЛицевойСчет В
	|				(ВЫБРАТЬ
	|					ЛицевыеСчета.Ссылка
	|				ИЗ
	|					Справочник.бит_ЛицевыеСчета КАК ЛицевыеСчета
	|				ГДЕ
	|					ЛицевыеСчета.Ссылка = &ЛицевойСчет)) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> &Удален
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицо";
	
	Запрос.УстановитьПараметр("Момент", 	 Момент);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Удален", ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()> 0 Тогда
		
		РезультатФизЛицо = РезультатЗапроса[0].ФизЛицо
	Иначе
		РезультатФизЛицо = Справочники.бит_Проживающие.ПустаяСсылка();
	КонецЕсли;
	Возврат РезультатФизЛицо;
	
КонецФункции

#КонецОбласти
